Hello @whereandy 👋 - I've tried the example folder as well. Hitting the same issues on version `v0.1.12`:

```hcl
resource "vantage_team" "demo_team" {
  name             = "Demo Team"
  description      = "Demo Team Description"
}
```

`terraform apply`

```hcl
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vantage_team.demo_team will be created
  + resource "vantage_team" "demo_team" {
      + description      = "Demo Team Description"
      + name             = "Demo Team"
      + token            = (known after apply)
      + user_emails      = (known after apply)
      + user_tokens      = (known after apply)
      + workspace_tokens = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes
```

`Apply complete! Resources: 1 added, 0 changed, 0 destroyed.`

**State after apply:**
```json
{
  "version": 4,
  "terraform_version": "1.4.6",
  "serial": 1,
  "lineage": "f8081511-6b2b-6cd2-fd2e-d3d3efe895ce",
  "outputs": {},
  "resources": [
    {
      "mode": "managed",
      "type": "vantage_team",
      "name": "demo_team",
      "provider": "provider[\"registry.terraform.io/vantage-sh/vantage\"]",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "description": "Demo Team Description",
            "name": "Demo Team",
            "token": "team_c76af6d352de4242",
            "user_emails": [],
            "user_tokens": [],
            "workspace_tokens": []
          },
          "sensitive_attributes": []
        }
      ]
    }
  ],
  "check_results": null
}
```

`terraform destroy`

```hcl
vantage_team.demo_team: Refreshing state... [name=Demo Team]
No changes. No objects need to be destroyed.
Destroy complete! Resources: 0 destroyed.
```

**State after destroy:**
```json
{
  "version": 4,
  "terraform_version": "1.4.6",
  "serial": 2,
  "lineage": "f8081511-6b2b-6cd2-fd2e-d3d3efe895ce",
  "outputs": {},
  "resources": [],
  "check_results": null
}
```

The team is still present in Portal as well. Worth noting - I'm the owner of the main workspace, I'm using a token with read/write permissions. Please let me know if you need the debug logs as well. 
<img width="1013" alt="image" src="https://github.com/vantage-sh/terraform-provider-vantage/assets/32144528/c711eeae-baee-4d46-b008-4a927ceece3e">


